Revit 2026 API

# IFCExportOptions Class

---

IFC Export options.

SystemObject Autodesk.Revit.DBIFCExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCExportOptions : IDisposable
```
```vb
Public Class IFCExportOptions
	Implements IDisposable
```
```cpp
public ref class IFCExportOptions : IDisposable
```
```fsharp
type IFCExportOptions =
    class
        interface IDisposable
    end
```

The IFCExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IFCExportOptions | Default constructor. Initializes FileVersion to Default. WallAndColumnSplitting and ExportBaseQuantities are set to false. FamilyMappingFile is set to empty. |
|  | IFCExportOptions(IFCExportOptions) | Creates a copy of an IFCExportOptions. |

|  | Name | Description |
| --- | --- | --- |
|  | ExportBaseQuantities | Option to export IFC standard quantities currently supported by Revit. |
|  | FamilyMappingFile | Path to a file containing family mapping. |
|  | FileVersion | IFC file version. |
|  | FilterViewId | Id of the view whose visibility settings will govern the contents in the exported IFC file. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SpaceBoundaryLevel | Level of space boundaries exported in IFC file. |
|  | WallAndColumnSplitting | Option to allow division of multi-level walls and columns by levels. |

|  | Name | Description |
| --- | --- | --- |
|  | AddOption | Adds a new named option to the options structure. |
|  | Assign | Assigns the values of the IFCExportOptions to this options object. |
|  | Dispose | Releases all resources used by the IFCExportOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace